EAtest/T7/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (	0 		-0.34 		0)	//0
	( 	2.15	-0.34		0)	//1
	(  	4.3		-0.34		0)	//2
	( 	7.3		-0.34		0)	//3
	( 	7.3		0.34		0)	//4
	(  	4.3		0.34		0)	//5
	( 	2.15	0.34		0)	//6
	(	0		0.34		0)	//7

	(	0 		-0.34 		0.2)	//8 
	( 	2.15	-0.34		0.2)  //9
	(  	4.3		-0.34		0.2)	//10
	( 	7.3		-0.34		0.2)	//11
	( 	7.3		0.34		0.2)	//12
	(  	4.3		0.34		0.2)	//13
	( 	2.15	0.34		0.2)	//14
	(	0		0.34		0.2)	//15

	(	0		-0.34 		0.65)	//16
	( 	2.15	-0.34	 	0.65)	//17
	(  	4.3		-0.34	 	0.65)	//18
	( 	7.3		-0.34	 	0.65)	//19
	( 	7.3		0.34	 	0.65)	//20
	(  	4.3		0.34	 	0.65)	//21
	( 	2.15	0.34	 	0.65)	//22
	(	0		0.34	 	0.65)	//23

	(	0		-0.34	 	1.2)	//24
	( 	2.15	-0.34	 	1.2)	//25
	(  	4.3		-0.34	 	1.2)	//26
	( 	7.3		-0.34	 	1.2)	//27
	( 	7.3		0.34		1.2)	//28
	(  	4.3		0.34	 	1.2)	//29
	( 	2.15	0.34	 	1.2)	//30
	(	0		0.34	 	1.2)	//31
	
);

// Mesh size (cm) : X ( 1.5 * 1.5 ) Refined zone ( 0.5 * 0.5 ) , Z  Near W.L. ( 0.5 * 0.5 ) Air ( 1 * 1 ) Water (Grading)

blocks
(
	hex (0 1 6 7 8 9 14 15) (108 1 10) simpleGrading (1 1 1) 	//b0
	hex (1 2 5 6 9 10 13 14) (108 1 10) simpleGrading (1 1 1)	//b1
	hex (2 3 4 5 10 11 12 13) (38 1 10) simpleGrading (10 1 1)	//b2

	hex (8 9 14 15 16 17 22 23) (108 1 23) simpleGrading (1 1 1)	//b3
	hex (9 10 13 14 17 18 21 22) (108 1 23) simpleGrading (1 1 1)	//b4
	hex (10 11 12 13 18 19 20 21) (38 1 23) simpleGrading (10 1 1)	//b5

	hex (16 17 22 23 24 25 30 31) (108 1 27) simpleGrading (1 1 1)  //b6	
	hex (17 18 21 22 25 26 29 30) (108 1 27) simpleGrading (1 1 1)	//b7
	hex (18 19 20 21 26 27 28 29) (38 1 27) simpleGrading (10 1 1)	//b8
);

edges
(
);

boundary
(

    oversetPatch
    {
        type overset;
        faces ();
   }

    inlet
    {
        type wall;
        faces
        (
			(0	8	15	7)
			(8	16	23	15)
			(16	24	31	23)
        );
    }
	
    outlet
    {
        type wall;
        faces
        (
			(3	4	12	11)
			(11	12	20	19)
			(19	20	28	27)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	7	6	1)
			(1	6	5	2)
			(2	5	4	3)

        );
    }
	
	
    sides
    {
        type empty;
        faces
        (
			(0	1	9	8)
			(1	2	10	9)
			(2	3	11	10)
			(8	9	16	17)
			(9	10	18	17)
			(10	11	19	18)
			(16	17	25	24)
			(17	18	26	25)
			(18	19	27	26)	//front

			(6	7	15	14)
			(5	6	14	13)
			(4	5	13	12)
			(14	15	23	22)
			(13	14	22	21)
			(12	13	21	20)
			(22	23	31	30)
			(21	22	30	29)
			(20	21	29	28)	//back
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(24	25	30	31)
			(25	26	29	30)
			(26	27	28	29)
        );
    }

    floatingObject
    {
        type wall;
        faces ();
    }
);

// ************************************************************************* //
